In [1]:
import pandas as pd

# Series

In [26]:
lst = [20,40,60,80]

x = pd.Series(lst, index = ['a','b','c','d'])
print(x)
print(type(x))
print(x[2], '\n')

x = pd.Series(lst, index = [101,102,103,104])
print(x)
print(type(x))
print(x[101], '\n')

x = pd.Series(lst, dtype="float", name="Series Basics")
print(x)
print(type(x))
print(x[2], '\n')

a    20
b    40
c    60
d    80
dtype: int64
<class 'pandas.core.series.Series'>
60

101    20
102    40
103    60
104    80
dtype: int64
<class 'pandas.core.series.Series'>
20

0    20.0
1    40.0
2    60.0
3    80.0
Name: Series Basics, dtype: float64
<class 'pandas.core.series.Series'>
60.0

C:\Users\anujp\AppData\Local\Temp\ipykernel_3600\3344642622.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(x[2], '\n')

In [27]:
record = {"name": ["Python", "Java", "C++", "Go"], "popularity": [100,90,80,70], "rank": [1,4,2,3]}

var1 = pd.Series(record)
print(var1)

name          [Python, Java, C++, Go]
popularity          [100, 90, 80, 70]
rank                     [1, 4, 2, 3]
dtype: object

In [31]:
s = pd.Series(17, index=[1,2,3,4,5,6,7])
print(s)

1    17
2    17
3    17
4    17
5    17
6    17
7    17
dtype: int64

In [33]:
s1 = pd.Series(21, index=[1,2,3,4,5,6,7])
s2 = pd.Series(21, index=[1,2,3,4])

print(s1 + s2)

1    42.0
2    42.0
3    42.0
4    42.0
5     NaN
6     NaN
7     NaN
dtype: float64

# Dataframe

In [38]:
lst = [10,20,30,40,50,60]

data = pd.DataFrame(lst)
print(data)
print(type(data))

    0
0  10
1  20
2  30
3  40
4  50
5  60
<class 'pandas.core.frame.DataFrame'>

In [59]:
record = {"name": ["A", "B", "C", "D"], 1:[1,2,3,4], "age": [10,20,30,40], "phone": ['Yes','Yes','Yes','No']}

data = pd.DataFrame(record, columns=['name', 'phone', 1], index=[2,4,6,8])
print(data, '\n')
# print(type(data))

print(data['name'], '\n')

print(data['name'][6], '\n')

# # Below code will give error since length of each column/series must be equal
# record2 = {"name": ["Python", "C++"], "popularity": [100,90,80,70], "rank": [1,4]}

  name phone  1
2    A   Yes  1
4    B   Yes  2
6    C   Yes  3
8    D    No  4

2    A
4    B
6    C
8    D
Name: name, dtype: object

C

In [61]:
lst = [[1,2,3,4,5],[60,70,80,90,100]]
data = pd.DataFrame(lst)
print(data)

    0   1   2   3    4
0   1   2   3   4    5
1  60  70  80  90  100

In [68]:
record = {'a':pd.Series([10,20,30,40]), 'b':pd.Series([50,60,70,80])}
x = pd.DataFrame(record)
print(x)
print(type(x))

    a   b
0  10  50
1  20  60
2  30  70
3  40  80
<class 'pandas.core.frame.DataFrame'>

# Arithmetic Operations on Dataframe

In [88]:
record = {"A":[1,2,3,4,5], "B":[60,70,80,90,100]}
data = pd.DataFrame(record)
print(data, '\n')

data["Sub"] = data["A"] - data["B"]

data["Div"] = data["A"] / data["B"]
data

   A    B
0  1   60
1  2   70
2  3   80
3  4   90
4  5  100

   A    B  Sub       Div
0  1   60  -59  0.016667
1  2   70  -68  0.028571
2  3   80  -77  0.037500
3  4   90  -86  0.044444
4  5  100  -95  0.050000

In [89]:
record = {"A":[15,16,17,18], "B":[101,102,103,104]}
data = pd.DataFrame(record)
print(data, '\n')

    A    B
0  15  101
1  16  102
2  17  103
3  18  104

In [93]:
record = {"A":[15,16,170,18], "B":[101,102,103,104]}
data = pd.DataFrame(record)

data["Below Threshold"] = data["A"] <= 16

data["Below B"] = data["A"] > data["B"]

print(data, '\n')

     A    B  Below Threshold  Below B
0   15  101             True    False
1   16  102             True    False
2  170  103            False     True
3   18  104            False    False

# Inserting data

In [120]:
record = {"A":[1,2,3,4,5], "B":[20,40,60,80,100], "C":[9,8,7,6,5]}
data = pd.DataFrame(record)
data

   A    B  C
0  1   20  9
1  2   40  8
2  3   60  7
3  4   80  6
4  5  100  5

In [121]:
data.insert(2, "Test", data["A"])
data

   A    B  Test  C
0  1   20     1  9
1  2   40     2  8
2  3   60     3  7
3  4   80     4  6
4  5  100     5  5

In [122]:
data.insert(1, "New", [21,31,41,51,61])
data

   A  New    B  Test  C
0  1   21   20     1  9
1  2   31   40     2  8
2  3   41   60     3  7
3  4   51   80     4  6
4  5   61  100     5  5

In [123]:
record = {"A":[1,2,3,4,5], "B":[20,40,60,80,100], "C":[9,8,7,6,5]}
data = pd.DataFrame(record)

data["New"] = data["B"][1:4]
data

   A    B  C   New
0  1   20  9   NaN
1  2   40  8  40.0
2  3   60  7  60.0
3  4   80  6  80.0
4  5  100  5   NaN

# Deleting data

In [124]:
data.pop("B")
data

   A  C   New
0  1  9   NaN
1  2  8  40.0
2  3  7  60.0
3  4  6  80.0
4  5  5   NaN

In [126]:
del data["C"]
data

   A   New
0  1   NaN
1  2  40.0
2  3  60.0
3  4  80.0
4  5   NaN